<p style="font-family:Verdana; font-size: 26px; color: orange"> Filter Pandas Dataframe with multiple conditions</p>

In [1]:
import pandas as pd
import numpy as np

<p style="font-family:Verdana; font-size: 22px; color: orange"> Filter Pandas Dataframe with multiple conditions</p>

> Creating a sample dataframe to proceed further

In [2]:
# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

# display dataframe
display(dataFrame)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

<p style="font-family:Verdana; font-size: 22px; color: orange"> Filter Pandas Dataframe with multiple conditions Using loc</p>

In [7]:
# filter dataframe Using loc
# Here we will get all rows having Salary greater or equal to 100000 
# and Age < 40 
# and their JOB starts with ‘D’
display(dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')),
                      # Print the details with Name and their JOB. 
                    ['Name','JOB']])

        Name       JOB
0   RACHEL    DESIGNER

<p style="font-family:Verdana; font-size: 22px; color: orange"> Filter Pandas Dataframe Using NumPy</p>

In [ ]:
# filter dataframe Using NumPy
# Here we will get all rows having Salary greater or equal to 100000 
# and Age < 40 
# and their JOB starts with ‘D’                                  
filtered_values = np.where((dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')))
print(filtered_values)
display(dataFrame.loc[filtered_values])

(array([0], dtype=int64),)

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

<p style="font-family:Verdana; font-size: 22px; color: orange"> Filter Pandas Dataframe Using Query (eval and query works only with columns)</p>

In [8]:
# filter dataframe Using NumPy
# Here we will get all rows having Salary lesser or equal to to 100000 
# and Age < 40 
# and their JOB starts with ‘C’         
display(dataFrame.query('Salary  <= 100000 & Age < 40 & JOB.str.startswith("C").values'))

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

<p style="font-family:Verdana; font-size: 22px; color: orange"> Pandas Boolean indexing multiple conditions standard way ("Boolean indexing" works with values in a column only)</p>

In [ ]:
# filter dataframe applying Boolean conditions
# Here we will get all rows having Salary lesser or equal to to 100000 
# and Age < 40 
# and their JOB starts with ‘B’  
 
display(dataFrame[(dataFrame['Salary']>=100000) & (dataFrame['Age']<40) 
                  & dataFrame['JOB'].str.startswith('P')][['Name','Age','Salary']])

<p style="font-family:Verdana; font-size: 22px; color: orange"> Eval multiple conditions  ("eval" and "query" works only with columns )</p>

In [9]:
# filter dataframe applying "eval" and "query" works only with columns
# Here we will get all rows having Salary lesser or equal to to 100000 
# and Age < 40 
# and their JOB starts with ‘A’  
display(dataFrame[dataFrame.eval("Salary <=100000 & (Age <40) & JOB.str.startswith('A').values")])

        Name  Age  Salary     JOB
5   JOEY       30   95000  ARTIST